    let azkarArray = [
    "اللهم إني أمسيت أشهدك، وأشهد حملة عرشك، وملائكتك، وجميع خلقك، أنك أنت الله لا إله إلا أنت وحدك لا شريك لك، وأن محمدًا عبدك ورسولك.",
    "اللهم ما أمسي بي من نعمة أو بأحد من خلقك فمنك وحدك لا شريك لك، فلك الحمد ولك الشكر.",
    "اللهم إني أعوذ بك من الهم والحزن، والعجز والكسل، والبخل والجبن، وضلع الدين وغلبة الرجال.",
    "اللهم إني أعوذ بك من عذاب في النار وعذاب في القبر ومن فتنة المحيا والممات، ومن فتنة المسيح الدجال.",
    "اللهم إني أسألك العفو والعافية في ديني ودنياي وأهلي ومالي.",
    "اللهم أمسينا وأمسى الملك لله، والحمد لله، لا إله إلا الله وحده لا شريك له، له الملك وله الحمد، وهو على كل شيء قدير.",
    "اللهم إني أعوذ بك من شر ما صنعت، ومن شر ما لم أصنع.",
    "اللهم إني أعوذ بك من الكسل والهم والحرمان وعذاب القبر.",
    "اللهم إني أسألك العافية في الدنيا والآخرة.",
    "اللهم إني أعوذ بك من الفقر والقلة والذلة في الدنيا والآخرة.",
    "اللهم إنا نعوذ بك من عذاب القبر، ومن عذاب جهنم، ومن فتنة المحيا والممات، ومن فتنة المسيح الدجال.",
    "اللهم إني أسألك الهدى والتقى والعفاف والغنى.",
    "اللهم أنت ربي، لا إله إلا أنت، خلقتني وأنا عبدك، وأنا على عهدك ووعدك ما استطعت، أعوذ بك من شر ما صنعت، أبوء لك بنعمتك علي، وأبوء بذنبي، فاغفر لي فإنه لا يغفر الذنوب إلا أنت.",
    "اللهم إنا نعوذ بك من النفاق والفقر، وأعوذ بك من عذاب القبر، لا إله إلا أنت.",
    "اللهم إنا نسألك العفو والعافية في ديننا ودنيانا وأهلنا ومالنا.",
    "اللهم إنا نسألك العافية في جسدنا وديننا ودنيانا وأهلنا ومالنا.",
    "اللهم إني أسألك الجنة وأعوذ بك من النار.",
    "اللهم إنا نعوذ بك من علم لا ينفع، ومن قلب لا يخشع، ومن نفس لا تشبع، ومن دعوة لا يستجاب لها.",
    "اللهم إني أعوذ بك من الهم والحزن والعجز والكسل والبخل والجبن وضلع الدين وغلبة الرجال.",
    "اللهم إني أعوذ بك من شر ما صنعت ومن شر ما لم أصنع.",
    ];

    let btn = document.getElementById("btn");
    let output = document.getElementById("output");
    var currentIndex = 0;
    function Azkar() {
        output.innerHTML = azkarArray[currentIndex];
        currentIndex = (currentIndex + 1) % azkarArray.length;
    }

    btn.addEventListener("click", Azkar);
    updateAzkar();